Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memf.tmx
Source language: ca
Languages: es_es

source: El sistema operatiu, d'una banda, permet que la persona usuària hi execute programes gestione els fitxers de dades, etc.; per a això, ofereix una interfície d'ús (vegeu més endavant).
es_es: El sistema operativo, por un lado, permite que la persona usuaria ejecute programas, gestione los ficheros de datos, etc.; para lo cual, ofrece una interfaz de uso (ver más adelante).

source: Vol dir això que tant un navegador com un processador de textos com una memòria de traducció contenen instruccions de programa per a executar aquestes operacions bàsiques?
es_es: ¿Quiere decir esto que tanto un navegador, como un procesador de textos o una memoria de traducción contienen instrucciones de programa para ejecutar estas operaciones básicas?

source: [Pentium:] nom genèric de diverses famílies de processadors d'Intel, successors del 486, amb un conjunt d'instruccions més complet i amb moltes millores internes.
es_es: \item[Pentium:] nombre genérico de varias familias de procesadores de Intel, sucesores del 486, con un conjunto de instrucciones más completo y con muchas mejoras internas.

source: Veureu que els continguts d'aquestes notes es poden dividir en tres parts: la primera presenta alguns conceptes bàsics de la informàtica (capítol ), i, més concretament, d'Internet (capítol ), sobre l'entrada i el processament de textos (capítol ), i sobre les bases de dades (capítol ); la segona és una introducció a alguns aspectes generals de la traducció automàtica (capítols a ), i la tercera, un recull d'aspectes més concretament referits a la traducció espanyol--català (capítols i ), els quals poden servir com a il·lustració de l'estudiat en un cas concret.
es_es: Veréis que los contenidos de estas notas se pueden dividir en tres partes: la primera presenta algunos conceptos básicos de la informática (capítulo ), y, más concretamente, de Internet (capítulo ), sobre la entrada y el procesamiento de textos (capítulo ), y sobre las bases de datos (capítulo ); la segunda es una introducción a algunos aspectos generales de la traducción automática (capítulos a ), y la tercera, una compilación de aspectos referidos más concretamente a la traducción español--catalán (capítulos y ), los cuales pueden servir como ilustración del estudiado en un caso concreto.

source: 720 GB 1,44 kB 1440 kB On resideix un programa d'ordinador mentre l'estem executant?
es_es: \begin{enumerate} \item 720~GB \item 1,44~kB \item 1440~kB \end{enumerate} \item ¿Dónde reside un programa de ordenador mientras lo estamos ejecutando? \begin{enumerate} \item En el disco duro o en un disquete.

source: L'asimetria fa referència al fet que la velocitat de transmissió de dades de la central cap a l'abonat és superior que la velocitat de transmissió de dades de l'abonat cap a la central (per exemple, 256 kB/s cap a l'abonat i 128 kB/s cap a la central).
es_es: La asimetria hace referencia al hecho de que la velocidad de transmisión de datos de la central hacia el abonado es superior que la velocidad de transmisión de datos del abonado hacia la central (por ejemplo, 256 kB/s hacia el abonado y 128 kB/s hacia la central).

source: Tots aquests conceptes es veuen potser més clars amb un exemple.
es_es: Todos estos conceptos pueden verse más claros con un ejemplo.

source: Per exemple, un processador de textos com Microsoft Word o WordPerfect pot estar compost per més d'un programa.
es_es: Por ejemplo, un procesador de textos como Microsoft Word o WordPerfect puede estar compuesto por más de un programa.

source: Salta a la instrucció .
es_es: Salta a la instrucción .

source: Si una carpeta està dividida en subcarpetes no pot contenir documents; els documents haurien d'anar dins de les subcarpetes Només en la carpeta arrel.
es_es: los documentos tendrían que ir dentro de las subcarpetas \item Sólo en la carpeta raíz.

source: Una carpeta no pot contenir només una altra carpeta.
es_es: \item Una carpeta no puede contener sólo otra carpeta.

source: En el CD-ROM.
es_es: \item En el CD-ROM.

source: La lectura d'aquestes notes ---que poden fins i tot contenir algun error no detectat--- no pot mai substituir l'estudi de bons llibres sobre la matèria, molts dels quals se citen en el text i es llisten en la bibliografia.
es_es: La lectura de estas notas ---que pueden incluso contener algún error no detectado--- no puede sustituir nunca el estudio de buenos libros sobre la materia, muchos de los cuales se citan en el texto y se listan en la bibliografía.

source: Les adreces de correu electrònic tenen dues parts, separades pel caràcter ``{ @}'', que se sol pronunciar at (en anglés, per part dels informátics més vells), { arrova}, rova o, per què no, ensaïmada.
es_es: Las direcciones de correo electrónico tienen dos partes que están separadas por el carácter "{ @}'', que se suele pronunciar at (sigla en inglés creada por parte de los antiguos informáticos), { arroba}, arroba o, por qué no, ensaimada, propiamente del catalán..

source: Els programadors normalment escriuen els seus programes en { llenguatges de programació} basats en instruccions més potents (com ara BASIC, FORTRAN, C, Pascal) i usen programes especials ---els processadors de llenguatges--- per a traduir-los a les instruccions senzilles que entén la màquina. Quasi tots els programes que s'executen en un ordinador han estat escrits en algun llenguatge de programació.
es_es: Los programadores normalmente escriben sus programas en { lenguajes de programación} basados en instrucciones más potentes (como por ejemplo BASIC, FORTRAN, C, Pascal) y usan programas especiales ---los procesadores de lenguajes--- para traducirlos a las instrucciones sencillas que entiende el ordenador. Casi todos los programas que se ejecutan en un ordenador han sido escritos en algún lenguaje de programación.

source: [Emmagatzematge:] els dispositius d'emmagatzematge es poden dividir en dos grups: [Memòria primària:] memòria ràpida de curt termini, volàtil (s'esborra quan s'apaga l'ordinador), que serveix per a guardar-hi programes i dades mentre l'ordinador està funcionant.
es_es: [Almacenamiento:] los dispositivos de almacenamiento se pueden dividir en dos grupos: [Memoria primaria:] memoria rápida de corto plazo, volátil (se borra cuando se apaga el ordenador), que sirve para guardar programas y datos mientras el ordenador está funcionando.

source: Quina d'aquestes afirmacions és incorrecta?
es_es: \end{enumerate} \item ¿Cuál de estas afirmaciones es cierta?

source: Encara que, com es mostra en la taula , l'indicatiu designa un estat del Pacífic anomenat Tuvalu
es_es: Aunque, como se muestra en la tabla , el indicativo designa un estado del Pacífico denominado Tuvalu

source: Alguns d'aquests buscadors tenen interfícies d'ús en català.
es_es: Algunos de estos buscadores tienen interfaces de uso en catalán.

source: Carrega el valor de suma en l'acumulador.
es_es: Carga el valor de suma en el acumulador.

source: Un disc de 6 gigaoctets conté aproximadament 6.000.000.000 octets.
es_es: Un disco de 6 gigabytes contiene aproximadamente 6.000.000.000 bytes.

source: Així garantim que el nostre treball està sempre accessible per a qualsevol persona que el considere útil per a l'ensenyament.
es_es: Así garantizamos que nuestro trabajo está siempre accesible para cualquier persona que lo considere útil para la enseñanza.

source: } de 17 polzades (pràcticament ja no s'instal·len monitors de tubs catòdics).
es_es: } de 17 pulgadas (prácticamente ya no se instalan monitores de tubos cadóticos).

source: [placa de so:] Una placa (o targeta) de so permet usar l'ordinador per a processar, enregistrar, reproduir, i manipular sons digitalitzats.
es_es: \item[tarjeta de sonido:] Una tarjeta (o placa) de sonido permite usar el ordenador para procesar, grabar, reproducir, y manipular sonidos digitalizados.

source: El sistema operatiu és el primer programa que comença a executar-se quan connectem l'ordinador.
es_es: El sistema operativo es el primer programa que empieza a ejecutarse cuando conectamos el ordenador.

source: Altres dispositius d'eixida són les impressores, les traçadores gràfiques, etc.
es_es: Otros dispositivos de salida son las impresoras, los trazadores gráficos o plotters, etc.

source: [Gestors de bases de dades] que serveixen per a emmagatzemar, organitzar i gestionar de diverses maneres la informació continguda en bases o bancs de dades (vegeu el capítol ).
es_es: [Gestores de bases de datos] que sirven para almacenar, organizar y gestionar de diferentes maneras la información contenida en bases o bancos de datos (ver el capítulo ).

source: {} converteix senyals analògics en informació digital.
es_es: \item {\ldots} convierte señales analógicas en información digital.

source: Sakurako es connecta a Internet per via telefònica amb un ordinador que té un processador de 1000 MHz, 128 megaoctets (megabytes) de RAM i un mòdem de 57600 bits per segon.
es_es: Sakurako se conecta a Internet por vía telefónica con un ordenador que tiene un procesador de 1000 MHz, 128 megabytes de RAM y un módem de 57600 bits por segundo.

source: Un exemple d'algorisme/programa és el següent, que diu si dues seqüències de caràcters (també anomenades cadenes de caràcters) són iguals o no.
es_es: Un ejemplo de algoritmo/programa es el siguiente, que dice si dos secuencias de caracteres (también llamadas cadenas de caracteres) son iguales o no.
